app/controllers/api/v1/admins_controller.rb

  def create
    @user = Admin.new()
		@user.email = params[:admin][:email]
		@user.password = params[:admin][:password]
		@user.save
    if @user.valid?
      sign_in(@user)
      respond_with User.all, :location => users_path
---
INSERT INTO `admins` (`created_at`, `email`, `encrypted_password`, `updated_at`) VALUES ('2014-12-19 11:00:13', 'veeru@me.com', '$2a$10$URREm2Eb.ULRXzOHFgER0.dimWuBTMlonGgHh55O.J92Iw9qOIsVO', '2014-12-19 11:00:13')
SELECT `users`.* FROM `users`