app/controllers/users_controller.rb

  def index
    @user = User.all
---
SELECT `users`.* FROM `users`

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`created_at`, `email`, `first_name`, `last_name`, `phone`, `updated_at`) VALUES ('2014-12-05 05:55:55', 'veeru4soft@yahoo.com', 'veeru', 'erukula', '9989361462', '2014-12-05 05:55:55')

  def update
    if @user.update_attributes(user_params)
---
UPDATE `users` SET `email` = 'ranjit_nyros@yahoo.com', `first_name` = 'Ranjit', `last_name` = 'P', `phone` = '9966123456', `updated_at` = '2014-12-12 05:26:24' WHERE `users`.`id` = 2